question-3-searchReq

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
 <soap:Body>
  <ns2:LowFareSearchReq xmlns="http://www.travelport.com/schema/common_v42_0" xmlns:ns2="http://www.travelport.com/schema/air_v42_0" xmlns:ns3="http://www.travelport.com/schema/vehicle_v42_0" xmlns:ns4="http://www.travelport.com/schema/cruise_v42_0" xmlns:ns5="http://www.travelport.com/schema/rail_v42_0" xmlns:ns6="http://www.travelport.com/schema/passive_v42_0" xmlns:ns7="http://www.travelport.com/schema/universal_v42_0" xmlns:ns8="http://www.travelport.com/schema/hotel_v42_0" xmlns:ns9="http://www.travelport.com/soa/common/security/SessionContext_v1" TraceId="f15bb9a6-73b0-4821-b548-8fac72cbe109" TargetBranch="P7085271">
   <BillingPointOfSaleInfo OriginApplication="UAPI"/>
   <ns2:SearchAirLeg>
    <ns2:SearchOrigin>
     <CityOrAirport Code="PVG"/>
    </ns2:SearchOrigin>
    <ns2:SearchDestination>
     <CityOrAirport Code="FRA"/>
    </ns2:SearchDestination>
    <ns2:SearchDepTime PreferredTime="2017-11-25"/>
   </ns2:SearchAirLeg>
   <ns2:SearchAirLeg>
    <ns2:SearchOrigin>
     <Airport Code="FRA"/>
    </ns2:SearchOrigin>
    <ns2:SearchDestination>
     <Airport Code="PVG"/>
    </ns2:SearchDestination>
    <ns2:SearchDepTime PreferredTime="2017-12-03"/>
   </ns2:SearchAirLeg>
   <ns2:AirSearchModifiers>
    <ns2:PreferredProviders>
     <Provider Code="1G"/>
    </ns2:PreferredProviders>
   </ns2:AirSearchModifiers>
   <SearchPassenger Code="ADT"/>
   <SearchPassenger Code="ADT"/>
   <SearchPassenger Code="CNN" Age="10"/>
   <SearchPassenger Code="CNN" Age="6"/>
   <SearchPassenger Code="INF" Age="1"/>
   <SearchPassenger Code="INF" Age="0"/>
   <ns2:AirPricingModifiers>
    <ns2:AccountCodes>
     <AccountCode Code="-"/>
    </ns2:AccountCodes>
   </ns2:AirPricingModifiers>
  </ns2:LowFareSearchReq>
 </soap:Body>
</soap:Envelope>
